# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?
# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10

s=int(input('Введите общее количество журавликов. Число должно быть кратным 6: '))
if s % 6 == 0:
    print('Петя сделал', int(s / 6), 'журавликов')
    print('Сережа сделал', int(s / 6), 'журавликов')
    print('Катя сделала', int(4 * s / 6), 'журавликов')
else:
    print('Введено число не кратное 6.')